[
{
  "name" : "Rachel Grey",
  "firstName" : "",
  "nickName" : "Ray",
  "middleName" : "Anne",
  "lastName" : "Summers",
  "height" : "5'7",
  "weight" : "125",
  "powers" : "Marvel Girl is a mutant with virtually unlimited telepathic powers, allowing her to read minds, project her thoughts into other minds, stun the minds of others with telepathic mental bolts, and cast psionic illusions such as those she uses to mask her facial tattoos. Marvel Girl also possesses telekinetic powers that allow her to levitate matter.  By levitating herself, Marvel Girl can fly at great speed.  The upper limits of her telepathic and telekinetic powers are not known.  Marvel Girl also possesses the psionic ability to project her own consciousness or those of others into the timestream, causing them to arrive in another time period within the body of their divergent counterpart or closest living ancestor or descendant.  Marvel Girl's past link with the Phoenix Force gave her even greater psionic abilities, such as being able to manipulate time, space, matter, and energy for virtually any purpose."
},
{
  "name" : "Radioactive Man",
  "firstName" : "Dr. Chen",
  "nickName" : "",
  "middleName" : "",
  "lastName" : "Lu",
  "height" : "6'6",
  "weight" : "290",
  "powers" : "The Radioactive Man's body is equivalent to a nuclear reactor.  He constantly emits a certain amount of radiation, and his body glows an iridescent green (although he can appear human by force of will).  He possesses superhuman strength and can also project his radiation for a variety of effects, such as heat blasts, a hypnotic light, beams of radioactive energy, and a force field sufficient enough to repel even Thor’s hammer.  His radiation often causes those around him to suffer nausea, dizziness, and other symptoms of radioactive poisoning, although his costume disguises a harness that allows him to remain harmless under normal circumstances. "
},
{
  "name" : "Rage",
  "firstName" : "Elvin",
  "nickName" : "",
  "middleName" : "Daryl",
  "lastName" : "Haliday",
  "height" : "6'6",
  "weight" : "450",
  "powers" : "A child possessed of a massive superhuman adult physique, Rage has tremendous superhuman strength and durability; for reasons unknown, his strength increases when he uses it in violent or aggressive ways.  His speed is superhuman (enabling him to outrun an express train with ease), and his stamina, reflexes and recuperative powers are also enhanced beyond normal human levels."
},
{
  "name" : "Random",
  "firstName" : "Marshall",
  "nickName" : "",
  "middleName" : "Evan",
  "lastName" : "Stone III",
  "height" : "5'6",
  "weight" : "125",
  "powers" : "Able to reshape protoplasmic body to alter physical properties, including size and strength; can shape forearms into weapons that fire hardened protoplasm; can randomly deflect any mutant powers directed at him."
},
{
  "name" : "Ravenous",
  "firstName" : "Unrevealed",
  "nickName" : "Ravenous",
  "middleName" : "",
  "lastName" : "",
  "height" : "6'7",
  "weight" : "975",
  "powers" : "All the Seekers contain the Essence or the Opposing Force.  It is the equivalent of the Power Cosmic.  It provides him with superhuman strength and durability, and can survive in the depths of space without breathing aid.  This makes the Seekers of the Negative Zone more than an adequate match for the Heralds of Galactus."
},
{
  "name": "Red Ghost",
  "firstName" : "Ivan",
  "nickName" : "",
  "middleName" : "",
  "lastName" : "Kragoff",
  "height" : "5'11",
  "weight" : "215",
  "powers" : "The Red Ghost is able to make his body insubstantial and pass through solid objects.  He is also able to solidify parts of his body to grasp physical objects while insubstantial, and make nearby objects become intangible.  If he becomes sufficiently intangible he becomes transparent or invisible and can walk on air."
},
{
  "name": "Red Hulk",
  "firstName" : "Thaddeus",
  "nickName" : "",
  "middleName" : "E.",
  "lastName" : "Ross",
  "height" : "7'0",
  "weight" : "1200",
  "powers" : "Red Hulk possesses an incredible level of superhuman physical strength, stamina and durability.  Unlike the Hulk (Bruce Banner), Hulk, whose physical strength is potentially limitless due to the fact that the Hulk's strength increases with his level of anger, the Red Hulk becomes hotter as he grows angrier leaving huge amounts of residual radiation after a heated confrontation.  This temperature increase may serve as a hindrance to the Red Hulk but that has yet to be determined.  The Red Hulk can also use his superhumanly strong leg muscles to leap great distances including into orbit around the Earth.  The Red Hulk has shown to be nearly invulnerable to physical damage regardless of the cause, and has also shown the ability to regenerate damaged areas of tissue at an amazing rate.  It is entirely possible that the Red Hulk also has the Hulk's resistance to extreme temperatures, poisons, and diseases but that, too, has yet to be revealed.  However, as in outer space, Red Hulk can hold his breath for an extremely long amount of time and function normally, even under times of great duress.  An attribute of the Red Hulk which isn't known to many is what gives him his tremendous power.  Red Hulk is able to absorb radiation at will, mostly gamma radiation, gamma radiation, but he can also absorb other types such as cosmic radiation.  The more he absorbs, the more powerful he becomes.  However, Red Hulk is susceptible to mind control.  At one time, Ross's mind controlled the form of Zzzax and commanded Zzzax's powers too.  When his mind was returned to his original body, Ross could still release some of the electromagnetic energy at will for a brief period."
},
{
  "name" : "Red Shift",
  "firstName" : "Unrevealed",
  "nickName" : "",
  "middleName" : "",
  "lastName" : "",
  "height" : "6'4",
  "weight" : "250",
  "powers" : "Red Shift has all the powers and abilities of one who possesses the power cosmic with the added talent of being able to open dimensional portals.  Red Shift can use his portals to either trap an enemy, pull items, such as meteors, through to attack his opponents, or redirect attacks meant for him back at his rivals. "
},
{
  "name" : "Red Skull",
  "firstName" : "Johann",
  "nickName" : "",
  "middleName" : "",
  "lastName" : "Shmidt",
  "height" : "6'2",
  "weight" : "240",
  "powers" : "None"
},
{
   "name" : "Rhino",
  "firstName" : "Aleksei",
  "nickName" : "Ray",
  "middleName" : "Mikhailovich",
  "lastName" : "Sytsevich",
  "height" : "6'5",
  "weight" : "710",
  "powers" : "The Rhino has superhuman strength enabling him to lift approximately 120 tons under optimal conditions.  He also possesses superhuman speed (capable of running at nearly 100 mph), endurance, and a high degree of imperviousness to physical harm even without Rhino suit.  The suit boosts his strength, features a bulletproof polymer mat rhino-like hide and two horns capable of penetrating 2-inch plate steel. It is highly impervious to damage, able to resist explosions equivalent to 1 ton of TNT, the impact of small anti-tank weaponry, and temperature extremes between -50˚ and 1,000˚ F without cracking or melting.  It is acid resistant and removeable. Recently rhino's horn has been bonded with adamantium and is indestructible."
},
{
  "name" : "Rick Jones",
  "firstName" : "Rick",
  "nickName" : "",
  "middleName" : "",
  "lastName" : "Jones",
  "height" : "6'8",
  "weight" : "980",
  "powers" : "No superhuman powers; formerly possessed powers similar to the Hulk (Bruce Banner), Hulk, causing him to transform into a gamma-powered behemoth of great strength and limited intellect.  Under special circumstances, Rick has been able to tap into the Destiny Force, a mysterious and near-infinite power source inherent in all of humanity.  Rick has used this ability to materialize figures from his imagination and from other time eras, to paralyze thousands of Kree and Skrulls, Skrull warriors simultaneously, to overwhelm an Atlanteans, Atlantean army, to heal his own broken body, to amplify his physical abilities and to levitate.  The limits of the Destiny Force's uses, if any, have not been revealed.  At a time when Rick was bonded with Captain Marvel (disambiguation), Captain Marvel, he was able to release minor jolts of energy from the Nega-Bands.  Through the bands, he possessed a telepathic link to Captain Marvel.  At one point he trained himself to usurp control of Genis' body, and to afflict him with psychic pain.As A-Bomb, Rick once again has superhuman strength and durability. His hide is similar to an armadillo's plated armor, giving A-Bomb bulletproof skin.  Camouflage glands from cuttlefish experiments give him the ability to blend into his surroundings at will, making him virtually undetectable.  He is also able to track both Hulk and Red Hulk by zeroing in on their gamma signature. "
},
{
   "name" : "Robbie Robertson",
  "firstName" : "Robbie",
  "nickName" : "",
  "middleName" : "",
  "lastName" : "Robertson",
  "height" : "6'1",
  "weight" : "210",
  "powers" : "None."
}
]
